RobWilks/nrf51_ADXL345/bikeVibeDigFilterInteger.c
/**
 * Copyright (c) 2015 - 2017, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

/** @file
 * @defgroup nrf_twi_master_example main.c
 * @{
 * @ingroup nrf_twi_example
 * @brief TWI Example Application main file.
 *
 * This file contains the source code for a sample application using TWI.
 */

#include "ADXL345.h"
#include "app_error.h"
#include "app_timer.h"
#include "app_twi.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "boards.h"
#include "bsp.h"
#include "compiler_abstraction.h"
#include "diskio_blkdev.h"
#include "ff.h"
#include "nrf.h"
#include "nrf_block_dev_sdc.h"
#include "nrf_delay.h"
#include "nrf_drv_clock.h"
#include "nrf_drv_rtc.h"
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#define NRF_LOG_MODULE_NAME "APP"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include <stdarg.h>     //rjw
#include <__vfprintf.h> //rjw


#define MAX_PENDING_TRANSACTIONS 5

#define APP_TIMER_PRESCALER 0
#define APP_TIMER_OP_QUEUE_SIZE 2

#define MAX_TEST_DATA_BYTES (15U) /**< max number of test bytes to be used for tx and rx. */
#define UART_TX_BUF_SIZE 256      /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE 256      /**< UART RX buffer size. */
#define DATA_BUFFER_SIZE 252      /**< data buffer for high frequency measurement. */

// added for SPI comms
#define FILE_NAME "ADXL_DAT.TXT"
#define TEST_STRING "SD card example.\r\n"

//mod for BLE400
#define SDC_SCK_PIN SPIM0_SCK_PIN   ///< SDC serial clock (SCK) pin.
#define SDC_MOSI_PIN SPIM0_MOSI_PIN ///< SDC serial data in (DI) pin.
#define SDC_MISO_PIN SPIM0_MISO_PIN ///< SDC serial data out (DO) pin.
#define SDC_CS_PIN SPIM0_SS_PIN     ///< SDC chip select (CS) pin.

//configure accelerometer data capture
#define SIZE_FFT 0x1000             //no of datapoints for each measurement; power of 2
#define TIME_TO_NEXT_MEASUREMENT 12 //in sec

//configure rtc timer
#define TICK_FREQUENCY 1024 //approx 1kHz
volatile bool timeOut = false;
volatile bool tick = false;

#define NO_FILES 100      //total number to measure in this sequence
#define MAX_FILE_NO 10000 //last file no available
char filename[] = "adxl0000.DAT";
#define DIG_FILTER 0
#define USE_SD 0

/**
 * @brief  SDC block device definition
 * */
NRF_BLOCK_DEV_SDC_DEFINE(
    m_block_dev_sdc,
    NRF_BLOCK_DEV_SDC_CONFIG(
        SDC_SECTOR_SIZE,
        APP_SDCARD_CONFIG(SDC_MOSI_PIN, SDC_MISO_PIN, SDC_SCK_PIN, SDC_CS_PIN)),
    NFR_BLOCK_DEV_INFO_CONFIG("Nordic", "SDC", "1.00"));

char data[50] = {0}; /* Line buffer */
// end of SPI / SDC

static app_twi_t m_app_twi = APP_TWI_INSTANCE(0);

bool got_callback;
bool button0_pressed = false;
bool button1_pressed = false;

extern int16_t xyz_int[3];
extern double xyz[3];

// Buffer for data read from sensors.
#define BUFFER_SIZE 11
uint8_t m_buffer[BUFFER_SIZE];

// Buffer for high frequency accelerometer data
uint8_t data_buffer[DATA_BUFFER_SIZE];

#if defined(__GNUC__) && (__LINT__ == 0)
// This is required if one wants to use floating-point values in 'printf'
// (by default this feature is not linked together with newlib-nano).
// Please note, however, that this adds about 13 kB code footprint...
__ASM(".global _printf_float");
#endif

////////////////////////////////////// coefficients for digital filter //////////////////////////////////////////

const int32_t calibrationCoeffs[3][2] = {
    621, 26, 309, 26, -455, 26}; // [x,y,z][mx+c] to convert 10 bit integer to acceleration in ms-2

const int32_t filterCoeffs[3][6] = {
    {277, -511, 237, 13, 1, -12},
    {10222, 670, 1762, 3163, 6327, 3163},
    {2909, -5654, 2751, 2828, -5657, 2828}}; // [Hw,Hl,Hh][a0,a1,a2,b0,b1,b2]

int32_t filteredValues[3][3][4] = {
    {{0, 0, 0, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}},
    {{0, 0, 0, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}},
    {{0, 0, 0, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}}};
// [rows][columns] [x,y,z][aa,bb,cc,dd] HwHhHl converts successively from aa->dd
uint8_t lastValue = 2; // index on filteredValues which is a cyclic buffer

