RobWilks/nrf51_ADXL345/bikeVibeDigFilterInteger.c
////////////////////////////////////// calibrate accelerometer measurements //////////////////////////////////////////
void calibrate(const int32_t coeffs[3][2], int32_t calibratedValues[3][3][4], int16_t measurements[3], uint8_t last) {
  uint8_t i;
  for (i = 0; i < 3; i++) {
    calibratedValues[i][last][0] = (((int32_t)measurements[i] << 8) - coeffs[i][0]) / coeffs[i][1];
  }
}

////////////////////////////////////// applyFilter //////////////////////////////////////////
void applyFilter(const int32_t filterCoeffs[3][6], int32_t filteredValues[3][3][4], uint8_t lastValue) {
  uint8_t i, j, k;
  for (i = 0; i < 3; i++) {   // over x, y, z
    for (j = 0; j < 3; j++) { // over Hw, Hl, Hh
      float result = 0;
      uint8_t l = lastValue;
      for (k = 0; k < 3; k++) { // over cyclic buffer
        result += filterCoeffs[j][k + 3] * filteredValues[i][l][j];
        if (k != 0)
          result -= filterCoeffs[j][k] * filteredValues[i][l][j + 1];
        if (l == 0) {
          l = 2;
        } else {
          --l;
        }
      }
      filteredValues[i][lastValue][j + 1] = result / filterCoeffs[j][0];
    }
  }
}

////////////////////////////////////// uart_printf //////////////////////////////////////////

void uart_printf(const char *fmt, ...) {
#if APP_UART_ENABLED
  char buf[200], *p;
  va_list ap;
  va_start(ap, fmt);
  vsnprintf(buf, sizeof(buf), fmt, ap);
  for (p = buf; *p; ++p)
    app_uart_put(*p);
  va_end(ap);
#endif // APP_UART_ENABLED
}

////////////////////////////////////// uart_error_handle //////////////////////////////////////////

void uart_error_handle(app_uart_evt_t *p_event) {
  if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR) {
    APP_ERROR_HANDLER(p_event->data.error_communication);
  } else if (p_event->evt_type == APP_UART_FIFO_ERROR) {
    APP_ERROR_HANDLER(p_event->data.error_code);
  }
}

////////////////////////////////////// default call back //////////////////////////////////////////

void default_cb(ret_code_t result, void *p_user_data) {

  if (result != NRF_SUCCESS) {
    uart_printf("default_cb - error: %d\r\n", (int)result);
    return;
  }
  got_callback = true;
}
////////////////////////////////////// read_data call back //////////////////////////////////////////
// read_data and call back
// result of read is in m_buffer[]

void read_data_cb(ret_code_t result, void *p_user_data) {
  got_callback = true;
  if (result != NRF_SUCCESS) {
    uart_printf("read_data_cb - error: %d\r\n", (int)result);
    return;
  }
}

/////////////////////////////////////// read_data /////////////////////////////////////////
void read_data(uint8_t address) {
  static uint8_t register_address;
  register_address = address;
  static app_twi_transfer_t const transfers[] =
      {
          ADXL345_READ(&register_address, m_buffer, 1)

      };
  static app_twi_transaction_t const transaction =
      {
          .callback = read_data_cb,
          .p_user_data = NULL,
          .p_transfers = transfers,
          .number_of_transfers = sizeof(transfers) / sizeof(transfers[0])};
  got_callback = false;

  APP_ERROR_CHECK(app_twi_schedule(&m_app_twi, &transaction));
}
////////////////////////////////////// read_xyz_data call back //////////////////////////////////////////
// read_data and call back
// result of read is in m_buffer[]

void read_xyz_data_cb(ret_code_t result, void *p_user_data) {
  if (result != NRF_SUCCESS) {
    uart_printf("read_data_cb - error: %d\r\n", (int)result);
    return;
  }
  // Each Axis @ All g Ranges: 10 Bit Resolution (2 Bytes)

  xyz_int[0] = (((int)m_buffer[1]) << 8) | m_buffer[0];
  xyz_int[1] = (((int)m_buffer[3]) << 8) | m_buffer[2];
  xyz_int[2] = (((int)m_buffer[5]) << 8) | m_buffer[4];

  get_Gxyz();

  for (int i = 0; i < 3; i++) {

    uart_printf("%6i = : %6i  ", i, xyz_int[i]);
  }
  uart_printf("\n");

  //  for (int i = 0; i < 3; i++) {
  //    uart_printf("%i = : %d.%d  ", i, NRF_LOG_FLOAT(xyz[i]));
  //    uart_printf("%i = : %8.3f  ", i,xyz[i]);
  //  }
  //  uart_printf("\n");
}
/////////////////////////////////////// read_xyz_data /////////////////////////////////////////
void read_xyz_data(uint8_t address) {

  // [these structures have to be "static" - they cannot be placed on stack
  //  since the transaction is scheduled and these structures most likely
  //  will be referred after this function returns]void read_xyz_data(uint8_t address) {

  static uint8_t register_address;
  register_address = address;
  static app_twi_transfer_t const transfers[] =
      {
          ADXL345_READ(&register_address, m_buffer, ADXL345_TO_READ)
          //         ADXL345_READ_XYZ_AND_TILT(&m_buffer[0])

      };
  static app_twi_transaction_t const transaction =
      {
          .callback = read_xyz_data_cb,
          .p_user_data = NULL,
          .p_transfers = transfers,
          .number_of_transfers = sizeof(transfers) / sizeof(transfers[0])};

  APP_ERROR_CHECK(app_twi_schedule(&m_app_twi, &transaction));
}

////////////////////////////////////// write_reg2 //////////////////////////////////////////
// value to write is in config
// uses twi_perform
void write_reg2(uint8_t address, uint8_t val) {

  static uint8_t config[2];
  config[0] = address;
  config[1] = val;

  app_twi_transfer_t const write_adxl345_data_format[] =
      {
          APP_TWI_WRITE(ADXL345_DEVICE, config, sizeof(config), 0)

      };
  APP_ERROR_CHECK(app_twi_perform(&m_app_twi, write_adxl345_data_format,
      1, NULL));
}

////////////////////////////////////////////////////////////////////////////////
// Buttons handling (by means of BSP).
// Only used in calibration run
//
static void bsp_event_handler(bsp_event_t event) {
  // Each time the button 1 or 4 is pushed we start a transaction reading
  // values of all registers from LM75B or MMA7660 respectively.
  switch (event) {
  case BSP_EVENT_KEY_0: // Button 0 pushed.
    button0_pressed = true;
    break;

