RobWilks/nrf51_ADXL345/bikeVibeDigFilterInteger.c
  case BSP_EVENT_KEY_1: // Button 1 pushed.
    button1_pressed = true;
    break;

  default:
    break;
  }
}
static void bsp_config(void) {
  uint32_t err_code;

  APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);

  err_code = bsp_init(BSP_INIT_BUTTONS,
      APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
      bsp_event_handler);
  APP_ERROR_CHECK(err_code);
}

////////////////////////////////////////////////////////////////////////////////
// TWI (with transaction manager) initialization.
static void twi_config(void) {
  uint32_t err_code;

  nrf_drv_twi_config_t const config = {
      .scl = ARDUINO_SCL_PIN,
      .sda = ARDUINO_SDA_PIN,
      .frequency = NRF_TWI_FREQ_400K,
      .interrupt_priority = APP_IRQ_PRIORITY_LOWEST,
      .clear_bus_init = false};

  APP_TWI_INIT(&m_app_twi, &config, MAX_PENDING_TRANSACTIONS, err_code);
  APP_ERROR_CHECK(err_code);
}

const nrf_drv_rtc_t rtc = NRF_DRV_RTC_INSTANCE(0); /**< Declaring an instance of nrf_drv_rtc for RTC0. */

/** @brief: Function for handling the RTC0 interrupts.
 * Triggered on COMPARE0 match.
 */
////////////////////////////////////////////////////////////////////////////////
// RTC tick events generation.
static void rtc_handler(nrf_drv_rtc_int_type_t int_type) {
  if (int_type == NRF_DRV_RTC_INT_COMPARE0) {
    timeOut = true;
  }
  if (int_type == NRF_DRV_RTC_INT_TICK) {
    tick = true;
  }
}

////////////////////////////////////////////////////////////////////////////////
// Initialize RTC instance with default configuration.
static void rtc_config(void) {
  uint32_t err_code;

  nrf_drv_rtc_config_t config = NRF_DRV_RTC_DEFAULT_CONFIG;
  config.prescaler = RTC_FREQ_TO_PRESCALER(TICK_FREQUENCY); //Set RTC frequency to 32Hz
  err_code = nrf_drv_rtc_init(&rtc, &config, rtc_handler);
  APP_ERROR_CHECK(err_code);

  // Power on RTC instance.
  nrf_drv_rtc_enable(&rtc);
}

////////////////////////////////////////////////////////////////////////////////

static void lfclk_config(void) {
  uint32_t err_code;

  err_code = nrf_drv_clock_init();
  APP_ERROR_CHECK(err_code);

  nrf_drv_clock_lfclk_request(NULL);
}
//////////////////////////////////////flash_led()//////////////////////////////////////////

static void flash_led(uint16_t noTimes, bool forever) {
  do {
    for (uint16_t j = 0; j < noTimes; j++) {
      LEDS_INVERT(BSP_LED_0_MASK);
      nrf_delay_ms(100);
      LEDS_INVERT(BSP_LED_0_MASK);
      nrf_delay_ms(300);
    }
    if (forever) {
      nrf_delay_ms(10000 - noTimes * 400);
    }
  } while (forever);
}
//////////////////////////////////////fatfs_init()//////////////////////////////////////////

/**
 * @brief Function for demonstrating FAFTS usage.
 */
static void fatfs_init() {
  static FATFS fs;
  static DIR dir;
  static FILINFO fno;
  static FIL file;

  uint32_t bytes_written;
  uint32_t bytes_read;
  FRESULT ff_result;
  DSTATUS disk_state = STA_NOINIT;

  // Initialize FATFS disk I/O interface by providing the block device.
  static diskio_blkdev_t drives[] =
      {
          DISKIO_BLOCKDEV_CONFIG(NRF_BLOCKDEV_BASE_ADDR(m_block_dev_sdc, block_dev), NULL)};

  diskio_blockdev_register(drives, ARRAY_SIZE(drives));

  uart_printf("Initializing disk 0 (SDC)...\r\n");
  for (uint32_t retries = 3; retries && disk_state; --retries) {
    disk_state = disk_initialize(0);
  }
  if (disk_state) {
    uart_printf("Disk initialization failed.\r\n");
    flash_led(4, true);
    return;
  }

  uint32_t blocks_per_mb = (1024uL * 1024uL) / m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_size;
  uint32_t capacity = m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_count / blocks_per_mb;
  uart_printf("Capacity: %d MB\r\n", capacity);

  uart_printf("Mounting volume...\r\n");
  ff_result = f_mount(&fs, "", 1);
  if (ff_result) {
    uart_printf("Mount failed.\r\n");
    flash_led(5, true);
    while (true) {
    }
    return;
  }

  // omit directory listing and dummy read/write
  // to do read config file from SD card
  /*
    uart_printf("\r\n Listing directory: /\r\n");
    ff_result = f_opendir(&dir, "/");
    if (ff_result)
    {
        uart_printf("Directory listing failed!\r\n");
        return;
    }
    
    do
    {
        ff_result = f_readdir(&dir, &fno);
        if (ff_result != FR_OK)
        {
            uart_printf("Directory read failed.");
            return;
        }
        
        if (fno.fname[0])
        {
            if (fno.fattrib & AM_DIR)
            {
                NRF_LOG_RAW_INFO("   <DIR>   %s\r\n",(uint32_t)fno.fname);
            }
            else
            {
                NRF_LOG_RAW_INFO("%9lu  %s\r\n", fno.fsize, (uint32_t)fno.fname);
            }
        }
    }
    while (fno.fname[0]);
    NRF_LOG_RAW_INFO("\r\n");
    
    uart_printf("Writing to file " FILE_NAME "...\r\n");
    ff_result = f_open(&file, FILE_NAME, FA_READ | FA_WRITE | FA_OPEN_APPEND);
    if (ff_result != FR_OK)
    {
        uart_printf("Unable to open or create file: " FILE_NAME ".\r\n");
        return;
    }

    ff_result = f_write(&file, TEST_STRING, sizeof(TEST_STRING) - 1, (UINT *) &bytes_written);
    if (ff_result != FR_OK)
    {
        uart_printf("Write failed\r\n.");
    }
    else
    {
        uart_printf("%d bytes written.\r\n", bytes_written);
    }

    (void) f_close(&file);
*/

  /*
// addition

//read content of the file
ff_result = f_open(&file, FILE_NAME, FA_READ);
if (ff_result != FR_OK)
{
    uart_printf("Unable to open or create file: " FILE_NAME ".\r\n");
    return;
}

uint16_t size = f_size(&file);
uart_printf("size of the file in bytes = %d\r\n", size);

bytes_read = 0;

ff_result = f_read(&file, data, sizeof(data), (UINT *)&bytes_read);

if (ff_result != FR_OK) {
  uart_printf("Unable to read or create file: " FILE_NAME ".\r\n");
  return;
} else {
  uart_printf("%d bytes read\r\n", bytes_read);
}
(void) f_close(&file);
*/
  return;
}
////////////////////////////////////////////////////////////////////////////////

int main(void) {
  uint16_t j = 0; // general counter

